#+title: Lab 6: Single Sample Hypothesis Tests
#+author: Ethan Coe-Renner

1. 
   1. H_0: p = 0.5, H_a: p \ne 0.5
   2. 
       #+begin_src R :results output :exports both
         z = qnorm(0.05)

         se = sqrt(0.5^2/115)

         print(0.5 + z * se)
         print(0.5 - z * se)

       #+end_src

       #+RESULTS:
       : [1] 0.4233083
       : [1] 0.5766917
   3. 
       #+begin_src R :results output :exports both
         survey= read.csv("~/school/statistics/surveySp2021.csv")

         prop=sum(survey$black_lives_matter == "Full Support") /
           length(survey$black_lives_matter)

         se = sqrt(0.5^2/115)
         z = (prop - 0.5)/se

         1 - pnorm(z)
       #+end_src

       #+RESULTS:
       : [1] 0.01598598
   4. The p-value is below 0.05 and the proportion of full support (0.6) is in the rejection region, therefore the overall proportion of pacific students who fully support BLM is significantly different from 0.5, we can reject the null.
2. 
   1. H_0 = 3.47, H_a < 3.47

   2. 
       #+begin_src R :results output :exports both
         z = qnorm(0.1)

         se = sqrt((3.47 * 0.53)/115)
         # not really sure about previous line (what goes in the numerator?)

         print(3.47 + z * se)
         print(3.47 - z * se)

       #+end_src

       #+RESULTS:
       : [1] 3.307935
       : [1] 3.632065

   3. 
       #+begin_src R :results output :exports both
         survey= read.csv("~/school/statistics/surveySp2021.csv")

         m = mean(survey$gpa)
         se = sd(survey$gpa) / sqrt(length(survey$gpa))

         z = (m - 3.47)/se

         pnorm(z)
       #+end_src

       #+RESULTS:
       : [1] 0.0006252355

   4. 0.0006 < 0.1 and the mean gpa (3.2) is in the rejection region \therefore I reject the null hypothesis.
